-- 系统初始化数据

-- 角色初始化
INSERT INTO `sys_role` VALUES (1, 'STUDENT', '学生', '2026-07-20 00:30:36');
INSERT INTO `sys_role` VALUES (2, 'COUNSELOR', '辅导员', '2026-07-20 00:30:36');
INSERT INTO `sys_role` VALUES (3, 'COLLEGE', '学院管理员', '2026-07-20 00:30:36');
INSERT INTO `sys_role` VALUES (4, 'SCHOOL', '学校管理员', '2026-07-20 00:30:36');

-- 用户初始化
INSERT INTO `sys_user` VALUES (1, 'admin', '$2a$10$uMIGZZoZ5w3Ec/UrgLOYbONmINKwJ4D0VuSRyKdwVwPbiNq6MktxS', '2026-07-20 14:33:19', '测试数据:管理员用户', 0, '2026-07-17 10:30:44', '2026-07-17 10:30:44');
INSERT INTO `sys_user` VALUES (2, 'school_demo', '$2a$10$o4itNBWvrDOU58VHsV5nCOaOadVhKeea3oeq4sYaSkHvQRMH1O1Ru', '2026-07-20 11:36:15', '学校管理员演示账号', 0, '2026-07-20 11:26:16', '2026-07-20 11:26:59');
INSERT INTO `sys_user` VALUES (3, 'college_demo', '$2a$10$Cn1aYNHMOWR3MaJNbDEkz.e2HORujw520sU2P6Mfz3cMGsAJiWL6K', '2026-07-20 15:12:43', '学院管理员演示账号', 0, '2026-07-20 11:26:16', '2026-07-20 11:27:01');
INSERT INTO `sys_user` VALUES (4, 'counselor_demo', '$2a$10$jVBy4qQ9PBDnaIY9l0mtr.FFNQFPZUuNgDaXv.xfuvR1wgBmTobMy', '2026-07-20 15:12:08', '辅导员演示账号', 0, '2026-07-20 11:26:16', '2026-07-20 11:27:03');
INSERT INTO `sys_user` VALUES (5, 'student_demo', '$2a$10$MRNdzRX5654.TZGEtFkLB.9lcToZjkr36TiIb/pa/dj5Sk4jQyaS2', '2026-07-20 15:11:29', '学生演示账号', 0, '2026-07-20 11:26:16', '2026-07-20 11:28:55');

-- 用户角色关联初始化
INSERT INTO `sys_user_role` VALUES (1, 1, 4, '2026-07-20 00:30:36');
INSERT INTO `sys_user_role` VALUES (1000001, 2, 4, '2026-07-20 11:26:16');
INSERT INTO `sys_user_role` VALUES (1000002, 3, 3, '2026-07-20 11:26:16');
INSERT INTO `sys_user_role` VALUES (1000003, 4, 2, '2026-07-20 11:26:16');
INSERT INTO `sys_user_role` VALUES (1000004, 5, 1, '2026-07-20 11:26:16');

-- 学院初始化
INSERT INTO `college` VALUES (1, 'MECH', '机械工程学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (2, 'MSE', '材料科学与工程学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (3, 'EPE', '能源与动力工程学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (4, 'EE', '电气工程学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (5, 'AERO', '航天航空学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (6, 'MATH', '数学与统计学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (7, 'SOM', '管理学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (8, 'SFL', '外国语学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (9, 'CS', '计算机科学与技术学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (10, 'SE', '软件学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (11, 'ECE', '电子科学与工程学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (12, 'AI', '人工智能学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (13, 'CHEM', '化学工程与技术学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (14, 'ARCH', '人居环境与建筑工程学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (15, 'LAW', '法学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (16, 'ECON', '经济与金融学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (17, 'PHYS', '物理学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (18, 'LIFE', '生命科学与技术学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (19, 'PUBLIC', '公共政策与管理学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `college` VALUES (20, 'JOURNAL', '新闻与新媒体学院', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);

-- 年级初始化
INSERT INTO `grade` VALUES (1, '2022', '2022级', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `grade` VALUES (2, '2023', '2023级', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `grade` VALUES (3, '2024', '2024级', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `grade` VALUES (4, '2025', '2025级', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `grade` VALUES (5, '2026', '2026级', 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);

-- 专业初始化
INSERT INTO `major` VALUES (1, 'ME001', '机械工程', 1, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (2, 'ME002', '智能制造工程', 1, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (3, 'ME003', '车辆工程', 1, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (4, 'MSE01', '材料科学与工程', 2, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (5, 'EPE01', '能源与动力工程', 3, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (6, 'EPE02', '新能源科学与工程', 3, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (7, 'EE001', '电气工程及其自动化', 4, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (8, 'AE001', '工程力学', 5, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (9, 'AE002', '飞行器设计与工程', 5, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (10, 'MA001', '数学与应用数学', 6, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (11, 'MA002', '统计学', 6, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (12, 'MG001', '工商管理', 7, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (13, 'MG002', '大数据管理与应用', 7, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (14, 'FL001', '英语', 8, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (15, 'FL002', '日语', 8, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (16, 'CS001', '计算机科学与技术', 9, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (17, 'CS002', '物联网工程', 9, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (18, 'SE001', '软件工程', 10, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (19, 'ECE01', '电子科学与技术', 11, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (20, 'ECE02', '微电子科学与工程', 11, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (21, 'AI001', '人工智能', 12, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (22, 'CE001', '化学工程与工艺', 13, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (23, 'CEV01', '土木工程', 14, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (24, 'CEV02', '建筑学', 14, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (25, 'LW001', '法学', 15, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (26, 'EC001', '经济学', 16, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (27, 'EC002', '金融学', 16, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (28, 'PH001', '应用物理学', 17, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);
INSERT INTO `major` VALUES (29, 'LS001', '生物医学工程', 18, 1, '2026-07-20 13:35:10', '2026-07-20 13:35:10', 0);

-- 班级初始化
INSERT INTO `class_info` VALUES (1, 'CS2401', '计科2401', 16, 3, 9, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (2, 'CS2402', '计科2402', 16, 3, 9, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (3, 'CS2501', '计科2501', 16, 4, 9, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (4, 'CS2601', '计科2601', 16, 5, 9, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (5, 'SE2401', '软工2401', 18, 3, 10, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (6, 'SE2501', '软工2501', 18, 4, 10, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (7, 'EE2401', '电气2401', 7, 3, 4, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (8, 'EE2501', '电气2501', 7, 4, 4, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
INSERT INTO `class_info` VALUES (9, 'FN2401', '金融2401', 27, 3, 16, 1, '2026-07-20 13:48:11', '2026-07-20 13:48:11', 0);
